data/RQ2/parfum_analysis_and_repair/google/fuzzbench/fuzzers/afl_splicing_mutation/builder.Dockerfile/repair.patch
diff --git a/Users/tdurieux/git/dinghy-experiment/data/evaluation/dockerfiles/google/fuzzbench/fuzzers/afl_splicing_mutation/builder.Dockerfile b/Users/tdurieux/git/dinghy-experiment/data/evaluation/dockerfile_repair_results/google/fuzzbench/fuzzers/afl_splicing_mutation/builder.Dockerfile/repaired.Dockerfile
index 1239d6c..e688ea7 100644
--- a/Users/tdurieux/git/dinghy-experiment/data/evaluation/dockerfiles/google/fuzzbench/fuzzers/afl_splicing_mutation/builder.Dockerfile
+++ b/Users/tdurieux/git/dinghy-experiment/data/evaluation/dockerfile_repair_results/google/fuzzbench/fuzzers/afl_splicing_mutation/builder.Dockerfile/repaired.Dockerfile
@@ -24,8 +24,8 @@ RUN git clone https://github.com/andreafioraldi/AFL-exp.git /afl && \
 
 # Use afl_driver.cpp from LLVM as our fuzzing library.
 RUN apt-get update && \
-    apt-get install wget -y && \
+    apt-get install --no-install-recommends wget -y && \
     wget https://raw.githubusercontent.com/llvm/llvm-project/5feb80e748924606531ba28c97fe65145c65372e/compiler-rt/lib/fuzzer/afl/afl_driver.cpp -O /afl/afl_driver.cpp && \
     clang -Wno-pointer-sign -c /afl/llvm_mode/afl-llvm-rt.o.c -I/afl && \
     clang++ -stdlib=libc++ -std=c++11 -O2 -c /afl/afl_driver.cpp && \
-    ar r /libAFL.a *.o
+    ar r /libAFL.a *.o && rm -rf /var/lib/apt/lists/*;